Revit 2024 API
NumberingSchema.GetNumbers Method
 Returns all numbers currently used in the given numbering sequence
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public IList<IntegerRange> GetNumbers(
	string partition
)
Visual Basic
Public Function GetNumbers ( _
	partition As String _
) As IList(Of IntegerRange)
Visual C++
public:
IList<IntegerRange^>^ GetNumbers(
	String^ partition
)
Parameters
partition
Type: System.String
 Name of the partition that identifies the sequence. The sequence must exist.
Return Value
 A collection of integer ranges
Remarks
Numbers are returned as a collection of ranges, where each range is a pair of two integer values, Low and High. As long as there is no gap currently in the sequence, there will be only one range.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The sequence partition does not exist in the schema.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
NumberingSchema Class
Autodesk.Revit.DB Namespace